

# Docs at:
# https://github.com/Homebrew/homebrew-bundle

# 'brew tap'
tap "homebrew/cask"

# 'brew install'
brew "neovim"
brew "tmux"
brew "the_silver_searcher"
# Version manager for Ruby, Node, Elixir, and other langs
brew "asdf"
brew "postgresql"
brew "gh"
# Display files and directories as a tree
brew "tree"

# 'brew install --cask'
cask "google-chrome"
cask "firefox"

cask "discord"
cask "iterm2"
cask "authy"
cask "bitwarden"
cask "visual-studio-code"

cask "rectangle"
cask "gyazo"

cask "zoom"

# Clipboard manager
cask "flycut"
# Battery life manager
cask "aldente"

cask "slack"

cask "docker"

cask "homebrew/cask-drivers/logitech-options"
cask "homebrew/cask-drivers/logitech-firmwareupdatetool"

cask "dropbox"

cask "cyberduck"

cask "vlc"

# Home media server
cask "jellyfin"

# Mechanical keyboard firmware
cask "via"

# VPN
cask "windscribe"
